#!/usr/bin/env python
# -*- coding:utf-8 -*-
# 都君丨大魔王
"""
文化程度的不同描述
"""
education_level_list = ['未知', '文盲与半文盲', '小学肄业', '相当小学毕业', '小学毕业', '小学', '初中肄业', '相当初中毕业',
                        '农业初中毕业', '职业初中毕业', '初中毕业', '初中', '高中肄业', '相当高中毕业', '农业高中毕业',
                        '职业高中毕业', '高中毕业', '高中', '技工学校肄业', '技工学校毕业', '技工学校', '中专或中技肄业',
                        '相当中专或中技毕业', '中技毕业', '中专毕业', '中等专业学校或中等技术学校', '专科肄业', '相当专科毕业',
                        '专科毕业', '大学专科和专科学校', '大学肄业', '相当大学毕业', '大学毕业', '大学本科', '研究生肄业', '研究生毕业',
                        '研究生', '博士', '博士后']
