#!/usr/bin/env python
# -*- coding:utf-8 -*-
# 都君丨大魔王
"""
港澳台行政区划
"""

gat_region = ['香港中西区', '香港东区', '香港南区', '香港湾仔区', '香港九龙城区', '香港观塘区', '香港深水埗区', '香港黄大仙区',
              '香港油尖旺区', '香港离岛区', '香港葵青区', '香港北区', '香港西贡区', '香港沙田区', '香港大埔区', '香港荃湾区',
              '香港屯门区', '香港元朗区', '澳门花地玛堂区', '澳门圣安多尼堂区', '澳门大堂区', '澳门望德堂区', '澳门风顺堂区',
              '澳门嘉模堂区', '澳门圣方济各堂区', '澳门路氹城', '台湾省新北市', '台湾省台北市', '台湾省桃园市', '台湾省台中市',
              '台湾省台南市', '台湾省高雄市', '台湾省基隆市', '台湾省新竹市', '台湾省嘉义市', '台湾省宜兰县', '台湾省新竹县苗栗县',
              '台湾省彰化县', '台湾省南投县', '台湾省云林县', '台湾省嘉义县', '台湾省屏东县', '台湾省花莲县', '台湾省台东县']
