#!/usr/bin/env python
# -*- coding:utf-8 -*-
# 都君丨大魔王
"""
关系描述
"""
# 相对关系
relative_relation = {
    '男朋友': '男', '女朋友': '女', '老公': '男', '老婆': '女', '岳父': '男', '女婿': '男', '岳母': '女', '公公': '男',
    '婆婆': '女', '儿媳': '女', '孙子': '男', '祖母': '女', '外祖母': '女', '祖父': '男', '外孙子': '男', '外祖父': '男',
    '孙女': '女', '外孙女': '女', '伯母': '女', '伯父': '男', '姑妈': '女', '姑丈': '男', '姑父': '男', '哥哥': '男',
    '弟弟': '男', '妹妹': '女', '姐姐': '女', '父亲': '男', '儿子': '男', '女儿': '女', '孩子': '女', '爸爸': '男',
    '母亲': '男', '妈妈': '女', '侄子': '男', '叔叔': '男', '婶婶': '女', '侄女': '女', '外甥女': '女', '舅舅': '男',
    '舅妈': '女', '外甥': '男', '爷爷': '男', '奶奶': '女', '姥爷': '男', '姥姥': '女', '表兄': '男', '表哥': '男',
    '表弟': '男', '表妹': '女', '表姐': '女', '堂兄': '男', '堂哥': '男', '堂弟': '男', '堂妹': '女', '堂姐': '女',
    '嫂嫂': '女', '大嫂': '女', '弟媳': '女', '媳妇': '女', '养子': '男', '养女': '女', '外婆': '女', '外公': '男',
    '情妇': '女', '情夫': '男', '兄弟': '男', '姐妹': '女'}

# 普通关系
normal_relation = ['上级', '下级', '下属', '同事', '工友', '同伙', '同乡', '朋友', '校友', '团友', '会友', '战友', '室友', '舍友',
                   '同学', '孩子', '情人', '老板', '员工', '秘书', '律师', '导师', '老师', '学生', '教官', '辅导员', '班主任',
                   '校长']

# 相互关系
interrelation = {
    '男朋友': ['女朋友'],
    '老公': ['老婆', '媳妇', '爱人'],
    '女婿': ['岳父', '岳母'],
    '儿媳': ['公公', '婆婆'],
    '孙子': ['爷爷', '奶奶', '祖父', '祖母'],
    '孙女': ['爷爷', '奶奶', '祖父', '祖母'],
    '外孙子': ['姥爷', '姥姥', '外公', '外婆', '外祖父', '外祖母'],
    '外孙女': ['姥爷', '姥姥', '外公', '外婆', '外祖父', '外祖母'],
    '侄子': ['叔叔', '婶婶', '伯父', '伯母', '姑姑', '姑父', '姑妈', '姑爷', '叔父'],
    '侄女': ['叔叔', '婶婶', '伯父', '伯母', '姑姑', '姑父'],
    '弟弟': ['哥哥', '表兄', '表哥', '堂哥', '堂兄', '姐姐', '表姐', '堂姐', '嫂嫂', '大嫂'],
    '弟媳': ['哥哥', '表兄', '表哥', '堂哥', '堂兄', '姐姐', '表姐', '堂姐', '嫂嫂', '大嫂'],
    '表弟': ['哥哥', '表兄', '表哥', '姐姐', '表姐', '嫂嫂', '大嫂'],
    '堂弟': ['哥哥', '堂哥', '堂兄', '姐姐', '堂姐', '嫂嫂', '大嫂'],
    '妹妹': ['哥哥', '表兄', '表哥', '堂哥', '堂兄', '姐姐', '表姐', '堂姐', '嫂嫂', '大嫂'],
    '妹夫': ['哥哥', '表兄', '表哥', '堂哥', '堂兄', '姐姐', '表姐', '堂姐', '嫂嫂', '大嫂'],
    '表妹': ['哥哥', '表兄', '表哥', '姐姐', '表姐', '嫂嫂', '大嫂'],
    '堂妹': ['哥哥', '堂哥', '堂兄', '姐姐', '堂姐', '嫂嫂', '大嫂'],
    '儿子': ['父亲', '爸爸', '母亲', '妈妈'],
    '女儿': ['父亲', '爸爸', '母亲', '妈妈'],
    '外甥': ['舅舅', '舅妈', '姨妈', '姨夫'],
    '外甥女': ['舅舅', '舅妈', '姨妈', '姨夫'],
}
